# -*- coding: utf-8 -*-
"""
Created on Sun Nov 21 14:41:42 2021

@author: siobh
"""

# Make a list of the hiragana and katakana alphabets
hiragana = ['あ','い','う','え','お',
            'か','き','く','け','こ',
            'が','ぎ','ぐ','げ','ご',
            'さ','ち','ス','せ','そ',
            'ざ','じ','ず','ぜ','ぞ',
            'た','ち','つ','て','と',
            'だ','ぢ','づ','で','ど',
            'な','に','ぬ','ね','の',
            'は','ひ','ふ','へ','ほ',
            'ば','び','ぶ','べ','ぼ',
            'ぱ','ぴ','ぷ','ぺ','ぽ',
            'ま','み','む','め','も',
            'ら','り','る','れ','ろ',
            'や','ゆ','よ',
            'わ','を',
            'ん'
            'ぴゃ','びゃ','ちゃ','じゃ','ぎゃ','りゃ','みゃ','ひゃ','にゃ','ちゃ','しゃ','きゃ',
            'ぴゅ','びゅ','ちゅ','じゅ','ぎゅ','りゅ','みゅ','ひゅ','にゅ','ちゅ','しゅ','きゅ',
            'ぴょ','びょ','ちょ','じょ','ぎょ','りょ','みょ','ひょ','にょ','ちょ','しょ','きょ',
            'っ']

katakana = ['ア','イ','ウ','エ','オ',
            'カ','キ','ク','ケ','コ',
            'ガ','ギ','グ','ゲ','ゴ',
            'サ','シ','ス','セ','ソ',
            'ザ','ジ','ズ','ぜ','ゾ',
            'タ','チ','ツ','テ','ト',
            'ダ','ぢ','ヅ','デ','ド',
            'ナ','ニ','ヌ','ネ','ノ',
            'ハ','ヒ','フ','ヘ','ホ',
            'バ','ビ','ブ','べ','ボ',
            'パ','ピ','プ','ぺ','ポ',
            'マ','ミ','ム','メ','モ',
            'ラ','リ','ル','レ','ロ',
            'ヤ','ユ','ヨ',
            'わ',
            'ン'
            'ピャ','ビャ','チャ','ジャ','ギャ','リャ','ミャ','ヒャ','ニャ','チャ','シャ','キャ',
            'ピュ','ビュ','チュ','ジュ','ギュ','リュ','ミュ','ヒュ','ニュ','チュ','シュ','キュ',
            'ピョ','ビョ','チョ','ジョ','ギョ','リョ','ミョ','ヒョ','ニョ','チョ','ショ','キョ',
            'ッ']





